测试文件_yzx/static/reports/static-dashboard/statistics.json
{
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 60477,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.745919936504784,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 30.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 2.0,
    "throughput" : 201.65990876837304,
    "receivedKBytesPerSec" : 1722.1834982220919,
    "sentKBytesPerSec" : 29.736959203148757
  },
  "GET article" : {
    "transaction" : "GET article",
    "sampleCount" : 60477,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.745919936504784,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 30.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 2.0,
    "throughput" : 201.65990876837304,
    "receivedKBytesPerSec" : 1722.1834982220919,
    "sentKBytesPerSec" : 29.736959203148757
  }
}